webservice/app/controllers/ivr_controller.rb

  def get_next_action
    puts params.inspect
    currentId = params[:currentposition]
    menuId = params[:menu]
    ivrData = get_configuration
    menu = get_menu menuId, ivrData

    if(menu != nil)
      nextNode = next_node menu, currentId
    end

    if(menuId == 2)
      nextNode = play_time(currentId)
    elsif(menuId == 3)
      menu3 = Menu3.new
      nextNode= menu3.get_next_action params[:callIdKey], currentId
    end

    if(nextNode == nil)
      #no more actions to do, lets delete this interaction
      interaction = Interaction.find_by interactionid: params[:callIdKey]
      if(interaction != nil)
        interaction.delete
---
SELECT "interactions".* FROM "interactions" WHERE "interactions"."interactionid" = '23423' LIMIT 1
DELETE FROM "interactions" WHERE "interactions"."id" = 5